Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAH169.PIC
      <edc:SFRDef edc:_addr="0x1F810250" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC17" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC17" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD9IS" edc:desc="" edc:mask="0x3" edc:name="ADCD9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD9IP" edc:desc="" edc:mask="0x7" edc:name="ADCD9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD10IS" edc:desc="" edc:mask="0x3" edc:name="ADCD10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD10IP" edc:desc="" edc:mask="0x7" edc:name="ADCD10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD11IS" edc:desc="" edc:mask="0x3" edc:name="ADCD11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD11IP" edc:desc="" edc:mask="0x7" edc:name="ADCD11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD12IS" edc:desc="" edc:mask="0x3" edc:name="ADCD12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD12IP" edc:desc="" edc:mask="0x7" edc:name="ADCD12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810260" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD13IS" edc:desc="" edc:mask="0x3" edc:name="ADCD13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD13IP" edc:desc="" edc:mask="0x7" edc:name="ADCD13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD14IS" edc:desc="" edc:mask="0x3" edc:name="ADCD14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD14IP" edc:desc="" edc:mask="0x7" edc:name="ADCD14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD15IS" edc:desc="" edc:mask="0x3" edc:name="ADCD15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD15IP" edc:desc="" edc:mask="0x7" edc:name="ADCD15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD16IS" edc:desc="" edc:mask="0x3" edc:name="ADCD16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD16IP" edc:desc="" edc:mask="0x7" edc:name="ADCD16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810270" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD17IS" edc:desc="" edc:mask="0x3" edc:name="ADCD17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD17IP" edc:desc="" edc:mask="0x7" edc:name="ADCD17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD18IS" edc:desc="" edc:mask="0x3" edc:name="ADCD18IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD18IP" edc:desc="" edc:mask="0x7" edc:name="ADCD18IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD19IS" edc:desc="" edc:mask="0x3" edc:name="ADCD19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD19IP" edc:desc="" edc:mask="0x7" edc:name="ADCD19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD20IS" edc:desc="" edc:mask="0x3" edc:name="ADCD20IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD20IP" edc:desc="" edc:mask="0x7" edc:name="ADCD20IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810280" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD21IS" edc:desc="" edc:mask="0x3" edc:name="ADCD21IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD21IP" edc:desc="" edc:mask="0x7" edc:name="ADCD21IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD22IS" edc:desc="" edc:mask="0x3" edc:name="ADCD22IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD22IP" edc:desc="" edc:mask="0x7" edc:name="ADCD22IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD23IS" edc:desc="" edc:mask="0x3" edc:name="ADCD23IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD23IP" edc:desc="" edc:mask="0x7" edc:name="ADCD23IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD24IS" edc:desc="" edc:mask="0x3" edc:name="ADCD24IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD24IP" edc:desc="" edc:mask="0x7" edc:name="ADCD24IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
