Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAH169.PIC
      <edc:SFRDef edc:_addr="0x1F860790" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATH" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATH0" edc:desc="" edc:mask="0x1" edc:name="CNSTATH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH1" edc:desc="" edc:mask="0x1" edc:name="CNSTATH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH2" edc:desc="" edc:mask="0x1" edc:name="CNSTATH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH3" edc:desc="" edc:mask="0x1" edc:name="CNSTATH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH4" edc:desc="" edc:mask="0x1" edc:name="CNSTATH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH5" edc:desc="" edc:mask="0x1" edc:name="CNSTATH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH6" edc:desc="" edc:mask="0x1" edc:name="CNSTATH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH7" edc:desc="" edc:mask="0x1" edc:name="CNSTATH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH8" edc:desc="" edc:mask="0x1" edc:name="CNSTATH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH9" edc:desc="" edc:mask="0x1" edc:name="CNSTATH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH10" edc:desc="" edc:mask="0x1" edc:name="CNSTATH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH11" edc:desc="" edc:mask="0x1" edc:name="CNSTATH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH12" edc:desc="" edc:mask="0x1" edc:name="CNSTATH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH13" edc:desc="" edc:mask="0x1" edc:name="CNSTATH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH14" edc:desc="" edc:mask="0x1" edc:name="CNSTATH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH15" edc:desc="" edc:mask="0x1" edc:name="CNSTATH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8607A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEH" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEH0" edc:mask="0x1" edc:name="CNNEH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH1" edc:mask="0x1" edc:name="CNNEH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH2" edc:mask="0x1" edc:name="CNNEH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH3" edc:mask="0x1" edc:name="CNNEH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH4" edc:mask="0x1" edc:name="CNNEH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH5" edc:mask="0x1" edc:name="CNNEH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH6" edc:mask="0x1" edc:name="CNNEH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH7" edc:mask="0x1" edc:name="CNNEH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH8" edc:mask="0x1" edc:name="CNNEH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH9" edc:mask="0x1" edc:name="CNNEH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH10" edc:mask="0x1" edc:name="CNNEH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH11" edc:mask="0x1" edc:name="CNNEH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH12" edc:mask="0x1" edc:name="CNNEH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH13" edc:mask="0x1" edc:name="CNNEH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH14" edc:mask="0x1" edc:name="CNNEH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH15" edc:mask="0x1" edc:name="CNNEH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8607B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFH" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFH0" edc:mask="0x1" edc:name="CNFH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH1" edc:mask="0x1" edc:name="CNFH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH2" edc:mask="0x1" edc:name="CNFH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH3" edc:mask="0x1" edc:name="CNFH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH4" edc:mask="0x1" edc:name="CNFH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH5" edc:mask="0x1" edc:name="CNFH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH6" edc:mask="0x1" edc:name="CNFH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH7" edc:mask="0x1" edc:name="CNFH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH8" edc:mask="0x1" edc:name="CNFH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH9" edc:mask="0x1" edc:name="CNFH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH10" edc:mask="0x1" edc:name="CNFH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH11" edc:mask="0x1" edc:name="CNFH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH12" edc:mask="0x1" edc:name="CNFH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH13" edc:mask="0x1" edc:name="CNFH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH14" edc:mask="0x1" edc:name="CNFH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH15" edc:mask="0x1" edc:name="CNFH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8607C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON0H" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON0H" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0H0" edc:mask="0x1" edc:name="SR0H0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0H1" edc:mask="0x1" edc:name="SR0H1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H2" edc:mask="0x1" edc:name="SR0H2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H3" edc:mask="0x1" edc:name="SR0H3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H4" edc:mask="0x1" edc:name="SR0H4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H5" edc:mask="0x1" edc:name="SR0H5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H6" edc:mask="0x1" edc:name="SR0H6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H7" edc:mask="0x1" edc:name="SR0H7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H8" edc:mask="0x1" edc:name="SR0H8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H9" edc:mask="0x1" edc:name="SR0H9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H10" edc:mask="0x1" edc:name="SR0H10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H11" edc:mask="0x1" edc:name="SR0H11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H12" edc:mask="0x1" edc:name="SR0H12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H13" edc:mask="0x1" edc:name="SR0H13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H14" edc:mask="0x1" edc:name="SR0H14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0H15" edc:mask="0x1" edc:name="SR0H15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
